{
  "backend/main.mo": "Main Motoko actor for the Snake game backend that manages multiplayer rooms, player profiles, and game state storage tied to caller Principals, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: landscape orientation enforcement, gyroscope tilt steering, and a tilt-control HUD toggle with localStorage persistence, each mapped to source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one- or two-sentence summaries for every frontend source file, covering game logic, UI components, hooks, and assets.",
  "frontend/index.css": "Global Tailwind CSS entry file defining OKLCH-based design token CSS variables for both light and dark themes, including sidebar and chart color tokens.",
  "frontend/index.html": "HTML entry point for the frontend app, configured as a Hill Climb Racing PWA with viewport meta tags, manifest link, and a root div for the React app.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Step-by-step guide for packaging the Snake Game PWA as an Android App Bundle using Bubblewrap/TWA and submitting it to the Google Play Store.",
  "frontend/public/.well-known/assetlinks.json": "Android Digital Asset Links file that delegates URL handling to the Snake Game Android app package, requiring a real SHA-256 certificate fingerprint to be filled in.",
  "frontend/public/manifest.webmanifest": "PWA web manifest for Hill Climb Racing specifying standalone display, landscape orientation, theme colors, and 512×512 regular and maskable icons.",
  "frontend/public/sw.js": "Service worker that caches Hill Climb Racing static assets on install and serves them from cache on fetch, with cache versioning and old-cache cleanup on activate.",
  "frontend/src/App.tsx": "Root React component that wraps SpaceSnakeScreen in a full-viewport dark-themed div with ThemeProvider and a Toaster notification component.",
  "frontend/src/game/animations.ts": "Exports animation timing constants (swap, clear, fall, etc.) and a simple promise-based wait utility.",
  "frontend/src/game/assets.ts": "Maps asset names to their static image file paths and provides a helper to compute sprite sheet positions for candy types.",
  "frontend/src/game/audio/audioManager.ts": "Singleton AudioManager class that loads, clones, and plays named sound effects with mute support; pre-loads silent placeholder audio for all game events.",
  "frontend/src/game/audio/sfx.ts": "Thin wrapper functions (playSwapSound, playMatchSound, etc.) that call audioManager.play with appropriate volume levels for each game event.",
  "frontend/src/game/boardGeneration.ts": "Generates an initial board free of pre-existing matches and provides a refill function that fills null cells with new random candies.",
  "frontend/src/game/boardReshuffle.ts": "Regenerates the board repeatedly until a configuration with at least one legal move is found, up to 10 attempts.",
  "frontend/src/game/CandyTile.tsx": "React component that renders a single match-3 candy tile using sprite-sheet background positioning, with special overrides for striped, wrapped, and color-bomb candy types and interaction event handlers.",
  "frontend/src/game/GameBoard.tsx": "React component that renders the match-3 game grid, handling click, mouse hover, and touch swipe/tap interactions to select cells and trigger swaps.",
  "frontend/src/game/GameScreen.tsx": "Top-level game screen component that composes the HUD, GameBoard, overlays, header (mute/restart), and footer using the useMatch3Game hook.",
  "frontend/src/game/gravity.ts": "Applies downward gravity to the board by compacting each column, returning the updated board and a list of candy fall movements.",
  "frontend/src/game/interaction.ts": "Utility functions for checking adjacency, validating board positions, and computing the neighboring position in a given direction.",
  "frontend/src/game/legalMoves.ts": "Scans the board to determine whether any swap between adjacent cells would produce a match, used to detect deadlock states.",
  "frontend/src/game/matchDetection.ts": "Finds all horizontal and vertical matches of 3+ same-type candies on the board, and checks whether a proposed swap would create a match.",
  "frontend/src/game/Overlays.tsx": "Defines two overlay components—GameOverOverlay and LevelCompleteOverlay—displayed on top of the board when the game ends or a level is finished.",
  "frontend/src/game/progression.ts": "Provides level configuration (target score and move count) and a helper to check whether the current score meets the level target.",
  "frontend/src/game/resolutionPipeline.ts": "Orchestrates match resolution by detecting matches, creating special candies, clearing positions, computing scores, and checking special candy activations.",
  "frontend/src/game/scoring.ts": "Calculates match scores (with an optional special multiplier), target scores per level, and initial move counts per level.",
  "frontend/src/game/specialActivations.ts": "Defines logic for computing target positions cleared by special candies (striped, wrapped, color-bomb) and detects special combo interactions like striped+striped clearing a full row and column.",
  "frontend/src/game/specialCandyRules.ts": "Determines which special candy type to create from a match (color-bomb for 5, striped for 4) and applies that special candy creation to the board.",
  "frontend/src/game/touchControls.ts": "Provides swipe detection logic by comparing start/end touch coordinates against a minimum threshold and returning the primary swipe direction.",
  "frontend/src/game/types.ts": "Defines core TypeScript types and constants for the match-3 game, including Candy, Position, Match, AnimationState, and GameState interfaces.",
  "frontend/src/game/useMatch3Game.ts": "React hook that manages the full match-3 game state, handling moves, cascade resolution, animations, scoring, level progression, and sound effects.",
  "frontend/src/hillclimb/assets.ts": "Exports a centralized ASSETS object mapping named asset keys to their generated image file paths for the Hill Climb game.",
  "frontend/src/hillclimb/daily/dailyChallenge.ts": "Generates a deterministic daily challenge based on the current date and provides helpers to check if the challenge has been completed or claimed.",
  "frontend/src/hillclimb/engine/failures.ts": "Checks vehicle failure conditions including flip detection based on rotation angle and crash detection based on high-speed ground impact.",
  "frontend/src/hillclimb/engine/fuel.ts": "Manages the vehicle fuel system with creation, continuous time-based depletion, and refueling functions.",
  "frontend/src/hillclimb/engine/hazards.ts": "Handles procedural hazard spawning ahead of the vehicle, cleanup of old hazards, and collision detection between hazards and the vehicle.",
  "frontend/src/hillclimb/engine/input.ts": "Defines the InputState interface for throttle and brake values and provides a factory function returning a zeroed input state.",
  "frontend/src/hillclimb/engine/physics.ts": "Provides basic 2D vector math utilities (add, subtract, scale, normalize, dot product, integration) used throughout the physics engine.",
  "frontend/src/hillclimb/engine/pickups.ts": "Manages procedural spawning of fuel and coin pickups along the terrain, and handles collision detection to collect them and update scoring or fuel.",
  "frontend/src/hillclimb/engine/renderer.ts": "Renders each game frame to a canvas, drawing the sky, terrain with gradient/texture, pickups with icons, hazards as styled rocks, and the vehicle with wheels using a camera that follows the vehicle.",
  "frontend/src/hillclimb/engine/scoring.ts": "Tracks and updates the player's score including distance traveled, coins earned from distance milestones, and stunt points accumulated during airtime.",
  "frontend/src/hillclimb/engine/stunts.ts": "Detects stunt states by tracking whether the vehicle is airborne and accumulating air time, resetting on landing.",
  "frontend/src/hillclimb/engine/terrain.ts": "Generates and samples procedural terrain using multi-octave sine-based noise, and computes terrain surface normals for vehicle alignment.",
  "frontend/src/hillclimb/engine/useFixedTimestep.ts": "A React hook that runs a fixed-timestep game loop using requestAnimationFrame and an accumulator pattern to call a step function at a consistent rate.",
  "frontend/src/hillclimb/engine/vehicle.ts": "Defines the vehicle data model and physics update logic including gravity, wheel ground contact, suspension forces, throttle/brake input, and terrain-aligned spawning.",
  "frontend/src/hillclimb/HillClimbApp.tsx": "Root component for the Hill Climb game that manages screen navigation (menu, garage, gameplay, results, etc.) and persists game state including coins, upgrades, and unlocks.",
  "frontend/src/hillclimb/progression/storage.ts": "Handles loading and saving persistent game state (coins, unlocked vehicles/photos, upgrade levels, daily claim history) to localStorage with migration support.",
  "frontend/src/hillclimb/progression/upgrades.ts": "Defines upgrade configurations for engine, suspension, tires, and fuel tank, and provides functions to calculate costs, check affordability, and apply upgrade stat modifiers.",
  "frontend/src/hillclimb/progression/vehicles.ts": "Defines the three available vehicles (Hill Climber, Dirt Bike, Monster Truck) with their base stats and unlock costs, plus a lookup helper.",
  "frontend/src/hillclimb/screens/DailyChallengeScreen.tsx": "Displays the daily challenge details, reward amount, and claim button, handling claim logic based on completion and eligibility state.",
  "frontend/src/hillclimb/screens/GameplayScreen.tsx": "The main gameplay screen that initializes all game systems, runs the fixed-timestep loop updating physics/fuel/pickups/hazards/scoring, renders to a canvas, and triggers run-end callbacks on failure.",
  "frontend/src/hillclimb/screens/GarageScreen.tsx": "Renders the Garage screen with tabs for browsing/selecting vehicles and purchasing upgrades, using the game state to show unlock status and coin balance.",
  "frontend/src/hillclimb/screens/MainMenuScreen.tsx": "Displays the main menu with buttons to start a run, open the garage, view the photo gallery, and access the daily challenge.",
  "frontend/src/hillclimb/screens/PhotoGalleryScreen.tsx": "Shows a grid of unlockable gallery photos, allowing players to view unlocked images or spend coins to unlock locked ones via a confirmation dialog.",
  "frontend/src/hillclimb/screens/ResultsScreen.tsx": "Displays post-run results including distance, coins earned, stunt points, and total coins, with options to play again or return to the menu.",
  "frontend/src/hillclimb/screens/StageSelectScreen.tsx": "Renders a grid of selectable race stages, each showing a preview image, name, and description, and triggers a callback when a stage is chosen.",
  "frontend/src/hillclimb/stages/stages.ts": "Defines the three game stages (canyon, desert, moon) with their terrain, hazard, gravity, and visual configurations, plus a helper to look up a stage by ID.",
  "frontend/src/hillclimb/ui/AuthAndSyncPanel.tsx": "Provides Internet Identity login/logout and cloud save/load functionality, converting between frontend and backend GameState formats and merging cloud data with local state.",
  "frontend/src/hillclimb/ui/DriveControls.tsx": "Renders touch-friendly brake and gas pedal buttons for the hill climb game, using pointer capture to reliably track press/release events and releasing inputs on visibility change or unmount.",
  "frontend/src/hillclimb/ui/Hud.tsx": "Displays the in-game HUD showing coin count, fuel progress bar, and distance traveled for the hill climb game.",
  "frontend/src/hillclimb/ui/Overlay.tsx": "A simple full-screen overlay wrapper component that centers its children inside a Card element.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useFullscreen.ts": "Custom hook that provides cross-browser fullscreen API support with enter, exit, and toggle functions, and tracks the current fullscreen state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login flow, identity persistence, and exposing login status and identity to consumers via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for checking room existence, creating a room, and polling room state from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, CSS custom properties for the dark-themed design system, base resets, and a rotate-to-landscape overlay animation for mobile.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/snake/DPad.tsx": "Empty file with no content.",
  "frontend/src/snake/Joystick.tsx": "Renders a virtual joystick component that tracks pointer drag input, clamps thumb movement to a circular boundary, and emits filtered steering angles via a callback.",
  "frontend/src/snake/joystickSteeringFilter.ts": "Provides a SteeringFilter class and utilities for stabilizing joystick input via deadzone, angular hysteresis, and smoothing to prevent jitter during circular thumb motion.",
  "frontend/src/snake/logic.ts": "Core game logic for the Space Snake game, including world constants, snake creation, pickup generation, movement, collision detection, AI behavior, and game state initialization/update functions.",
  "frontend/src/snake/multiplayer/MultiplayerConnectingScreen.tsx": "Displays a connecting/reconnecting/disconnected status card UI for multiplayer rooms, with retry and leave/cancel actions.",
  "frontend/src/snake/multiplayer/MultiplayerConnectionIndicator.tsx": "A small overlay indicator that shows reconnecting or disconnected status icons; renders nothing when the connection is active.",
  "frontend/src/snake/multiplayer/MultiplayerHUD.tsx": "Renders a HUD leaderboard panel showing the top 3 players by score in a multiplayer game session, highlighting the local player.",
  "frontend/src/snake/multiplayer/MultiplayerRoomCodePanel.tsx": "Displays the current multiplayer room code with a copy-to-clipboard button, showing success or error feedback states.",
  "frontend/src/snake/multiplayer/MultiplayerRoomContext.tsx": "React context provider that manages multiplayer room state (create, join, leave) by interacting with the backend actor, including auto-joining from URL room codes.",
  "frontend/src/snake/multiplayer/MultiplayerSnakeCanvas.tsx": "React canvas component that renders the multiplayer snake game, handling camera tracking, tiled background, grid, snakes, and pickups using a requestAnimationFrame loop with image caching.",
  "frontend/src/snake/multiplayer/types.ts": "TypeScript type definitions for multiplayer snake entities, game state, and room info.",
  "frontend/src/snake/multiplayer/urlRoomCode.ts": "Utility functions to read, write, clear, and build invite URLs for room codes stored in URL query parameters.",
  "frontend/src/snake/multiplayer/useInputSubmission.ts": "Hook that periodically submits the local player's current angle to the backend at 20Hz; the actual actor call is currently a placeholder stub.",
  "frontend/src/snake/multiplayer/useMultiplayerRoom.ts": "Thin wrapper hook that re-exports the multiplayer room state and actions from the shared MultiplayerRoomContext.",
  "frontend/src/snake/multiplayer/useNickname.ts": "Hook that manages a player nickname with localStorage persistence and length validation.",
  "frontend/src/snake/multiplayer/useRoomPolling.ts": "Hook that polls the backend for room state every 100ms using React Query, tracking connection status based on consecutive failures.",
  "frontend/src/snake/pickupSprites.ts": "Defines a 4×4 food sprite sheet layout and provides helpers to deterministically select a sprite by pickup ID and get render sizes by pickup type.",
  "frontend/src/snake/RotateToLandscapeOverlay.tsx": "Full-screen overlay component that blocks gameplay and prompts the user to rotate their device to landscape orientation when in portrait mode.",
  "frontend/src/snake/SnakeBoosters.tsx": "Renders a row of three disabled booster buttons (magnet, boost, plus) with sprite-based icons and zero counts using WZ assets.",
  "frontend/src/snake/SnakeCanvas.tsx": "Canvas-based renderer for the snake game that draws a tiled background, food pickups, coins, and snakes using a camera-following, toroidal-wrapping world-to-screen projection.",
  "frontend/src/snake/SnakeHUD.tsx": "Displays the in-game HUD including a top-3 leaderboard panel and a mission progress panel with a countdown timer circle.",
  "frontend/src/snake/SnakeMainMenu.tsx": "Main menu screen with solo play and multiplayer tabs, allowing players to set a nickname, create or join a room, and copy an invite URL.",
  "frontend/src/snake/SnakeMinimap.tsx": "Renders a small canvas minimap showing player and AI snake positions relative to the world, plus a viewport indicator rectangle.",
  "frontend/src/snake/SnakeMissionCompleteOverlay.tsx": "Simple overlay panel displayed when a mission is completed, showing a celebration icon and a message that a new mission is starting.",
  "frontend/src/snake/SnakeOverlays.tsx": "Provides two overlay components: PauseOverlay with a resume button and GameOverOverlay showing final score and length with a play-again button.",
  "frontend/src/snake/SnakeScreen.tsx": "Top-level screen component that orchestrates single-player and multiplayer snake gameplay, composing the canvas, HUD, minimap, joystick, overlays, and multiplayer connection/room panels.",
  "frontend/src/snake/SpaceSnakeCanvas.tsx": "React canvas component that renders the Space Snake game, including a starfield background, snake bodies/heads with eyes and glow effects, and coins, all offset by a camera position centered on the player.",
  "frontend/src/snake/SpaceSnakeGameOverOverlay.tsx": "Modal overlay displayed when the player is eliminated, showing their final score and rank with a 'Play Again' button.",
  "frontend/src/snake/SpaceSnakeJoystick.tsx": "Touch/pointer-based virtual joystick component that tracks drag angle and reports it via an onAngleChange callback for mobile snake steering.",
  "frontend/src/snake/SpaceSnakeLeaderboard.tsx": "Displays a top-players leaderboard panel with rank, name, and score, highlighting the current player's entry.",
  "frontend/src/snake/spaceSnakeLogic.ts": "Core single-player Space Snake game logic including entity creation, movement, collision, bot AI, coin spawning, and game state initialization.",
  "frontend/src/snake/SpaceSnakeMainMenu.tsx": "Main menu screen with a starfield background, game title, animated snake preview, nickname input, and a play button to start the game.",
  "frontend/src/snake/SpaceSnakeMinimap.tsx": "Circular canvas minimap that renders scaled-down positions of coins, bots, and the player within the game world.",
  "frontend/src/snake/SpaceSnakeMissionBanner.tsx": "HUD banner showing the current mission objective (collect coins), displaying progress and a countdown timer.",
  "frontend/src/snake/SpaceSnakeScoreCounter.tsx": "Simple HUD component that displays the player's current score as a zero-padded monospace number at the bottom center of the screen.",
  "frontend/src/snake/SpaceSnakeScreen.tsx": "Top-level screen component for the Space Snake game that manages navigation between menu and game screens, tilt controls, orientation detection, and composes all HUD overlays (leaderboard, minimap, joystick, score, mission banner, game over).",
  "frontend/src/snake/SpaceSnakeTiltToggle.tsx": "A mobile-only toggle button component that enables or disables gyroscope/tilt controls, displaying active/inactive visual states using a rotated smartphone icon.",
  "frontend/src/snake/types.ts": "TypeScript type definitions for the arena snake game, including Vector2, Snake, Pickup, MissionState, and SnakeGameState.",
  "frontend/src/snake/useCanvasViewport.ts": "Hook that measures a container element's dimensions with devicePixelRatio support using ResizeObserver, debounced via requestAnimationFrame to minimize layout thrashing.",
  "frontend/src/snake/useLandscapeOrientation.ts": "Hook that tracks whether the device is in landscape orientation by comparing window width and height, updating on resize and orientation change events.",
  "frontend/src/snake/useSnakeGame.ts": "React hook managing the classic snake game loop, including player movement with turn-rate limiting, AI updates, pickup collisions, mission timer, and support for joystick, keyboard, and tilt input sources.",
  "frontend/src/snake/useSpaceSnakeGame.ts": "React hook managing the Space Snake game loop with requestAnimationFrame, handling steering input (joystick/mouse/tilt), mission countdown timer, landscape pause, and game restart.",
  "frontend/src/snake/useTiltControls.ts": "React hook that reads DeviceOrientation gamma axis to produce a steering angle for tilt-based snake controls, with deadzone filtering and iOS 13+ permission handling.",
  "frontend/src/snake/wzAssets.ts": "Centralized export of asset file paths (background, HUD, pickups, buttons, etc.) used by the Worms Zone-style snake game.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radius variables, and font families for the frontend.",
  "project_state.json": "Project state manifest tracking the Space Snake game's existing features (landscape enforcement, gyroscope tilt steering, tilt HUD toggle) and a pending feature request for mobile orientation/tilt improvements."
}