{
  "backend/main.mo": "Core backend actor defining user profiles, game state, rooms, and access-controlled APIs for a multiplayer snake-like game.",
  "feature_evidence.json": "Metadata listing implemented features, associated files, components, and test IDs for project tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the functionality of numerous frontend game-related files.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining theming for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the Hill Climb app with metadata, icons, and manifest.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Instructions for packaging the Snake Game PWA as an Android app using TWA and submitting it to Google Play.",
  "frontend/public/.well-known/assetlinks.json": "TWA asset links file mapping the PWA to its Android app package and certificate fingerprint.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, theme, metadata, and startup parameters for Hill Climb.",
  "frontend/public/sw.js": "Service worker implementing static asset caching and cache version cleanup for offline support.",
  "frontend/src/App.tsx": "React root component initializing the service worker and rendering HillClimbApp with theming and toasts.",
  "frontend/src/game/animations.ts": "Defines animation timing constants and a helper to wait asynchronously.",
  "frontend/src/game/assets.ts": "Maps game asset paths and provides a helper for candy sprite positioning.",
  "frontend/src/game/audio/audioManager.ts": "Implements a basic audio manager for loading, playing, and muting sound effects with placeholder sounds.",
  "frontend/src/game/audio/sfx.ts": "Exports convenience functions to trigger specific game sound effects.",
  "frontend/src/game/boardGeneration.ts": "Generates initial and refill boards with random candies while avoiding immediate matches.",
  "frontend/src/game/boardReshuffle.ts": "Reshuffles the board until at least one legal move exists.",
  "frontend/src/game/CandyTile.tsx": "Component rendering a candy tile with sprite selection, special candy handling, and interaction events.",
  "frontend/src/game/GameBoard.tsx": "Renders the match-3 grid, handling touch and mouse interactions to select, highlight, and attempt swaps while reflecting animation states.",
  "frontend/src/game/GameScreen.tsx": "Main game UI combining HUD, board, audio controls, and overlays for game over and level completion.",
  "frontend/src/game/gravity.ts": "Applies gravity to make candies fall and returns fall information.",
  "frontend/src/game/interaction.ts": "Defines helpers for checking adjacency, position validity, and directional movement.",
  "frontend/src/game/legalMoves.ts": "Detects if the board contains any legal move by testing potential swaps.",
  "frontend/src/game/matchDetection.ts": "Finds horizontal and vertical matches and checks if a swap would create one.",
  "frontend/src/game/Overlays.tsx": "Provides simple game-over and level-complete overlay components with icons and action buttons.",
  "frontend/src/game/progression.ts": "Provides level configuration and checks if the player met the target score.",
  "frontend/src/game/resolutionPipeline.ts": "Resolves matches, handles special candy creation and activations, applies clearing logic, and computes score gains.",
  "frontend/src/game/scoring.ts": "Calculates scoring for clears and defines level target score and initial moves.",
  "frontend/src/game/specialActivations.ts": "Computes target cells for each special candy type and detects striped+striped combo effects.",
  "frontend/src/game/specialCandyRules.ts": "Determines which special candy to create from matches and applies creation to the board.",
  "frontend/src/game/touchControls.ts": "Detects swipe direction based on touch start and end positions.",
  "frontend/src/game/types.ts": "Defines core Match‑3 game constants, board types, candy types, and game/animation state structures.",
  "frontend/src/game/useMatch3Game.ts": "Main hook managing Match‑3 game state, level flow, input handling, animations, and cascade resolution.",
  "frontend/src/hillclimb/assets.ts": "Provides file paths for Hill Climb UI, stage, vehicle, and gallery image assets.",
  "frontend/src/hillclimb/daily/dailyChallenge.ts": "Generates deterministic daily challenges and checks claim/completion state.",
  "frontend/src/hillclimb/engine/failures.ts": "Evaluates vehicle flip and crash conditions based on rotation, speed, and ground contact.",
  "frontend/src/hillclimb/engine/fuel.ts": "Implements fuel system creation, depletion, and refueling logic.",
  "frontend/src/hillclimb/engine/hazards.ts": "Spawns hazards, updates their lifecycle, and detects collisions with the vehicle.",
  "frontend/src/hillclimb/engine/input.ts": "Defines basic throttle/brake input state and returns default neutral input.",
  "frontend/src/hillclimb/engine/physics.ts": "Provides 2D vector operations and simple integration utilities.",
  "frontend/src/hillclimb/engine/pickups.ts": "Spawns fuel/coin pickups, removes old ones, and detects collection for scoring and refueling.",
  "frontend/src/hillclimb/engine/renderer.ts": "Renders each frame by drawing terrain, pickups, hazards, and the vehicle with a camera following the car.",
  "frontend/src/hillclimb/engine/scoring.ts": "Updates distance, coin rewards, and stunt points based on vehicle movement and stunt state.",
  "frontend/src/hillclimb/engine/stunts.ts": "Tracks airborne state, airtime, and resets stunt data upon landing.",
  "frontend/src/hillclimb/engine/terrain.ts": "Defines terrain config and sampling functions using simple multi‑octave noise and normal calculation.",
  "frontend/src/hillclimb/engine/useFixedTimestep.ts": "Runs a fixed‑timestep game loop using requestAnimationFrame and an accumulator.",
  "frontend/src/hillclimb/engine/vehicle.ts": "Updates vehicle physics including gravity, suspension, drive forces, rotation alignment, and speed clamping.",
  "frontend/src/hillclimb/HillClimbApp.tsx": "Top‑level Hill Climb app component controlling screen navigation and persistent game state updates.",
  "frontend/src/hillclimb/progression/storage.ts": "Loads and saves persistent game progression, ensuring photo‑1 is always unlocked.",
  "frontend/src/hillclimb/progression/upgrades.ts": "Defines upgrade configs, cost logic, and applies stat modifiers to vehicle base stats.",
  "frontend/src/hillclimb/progression/vehicles.ts": "Provides vehicle configurations with stats and unlock costs and a lookup function by ID.",
  "frontend/src/hillclimb/screens/DailyChallengeScreen.tsx": "UI screen showing the daily challenge, completion state, and reward claim button.",
  "frontend/src/hillclimb/screens/GameplayScreen.tsx": "Main gameplay component initializing systems, running the game loop, and handling physics, scoring, fuel, pickups, and hazards.",
  "frontend/src/hillclimb/screens/GarageScreen.tsx": "UI for selecting vehicles and purchasing upgrades, handling unlocks, affordability checks, and cloud sync panel integration.",
  "frontend/src/hillclimb/screens/MainMenuScreen.tsx": "Main menu showing logo and navigation buttons for starting a run, garage, gallery, and daily challenge.",
  "frontend/src/hillclimb/screens/PhotoGalleryScreen.tsx": "Displays a grid of photos with unlock logic, viewing modal, and coin‑based purchase flow.",
  "frontend/src/hillclimb/screens/ResultsScreen.tsx": "Shows run results including distance, coins, stunt points, and provides actions to replay or return to menu.",
  "frontend/src/hillclimb/screens/StageSelectScreen.tsx": "Presents a list of stages with previews; selecting a card triggers stage selection callback.",
  "frontend/src/hillclimb/stages/stages.ts": "Defines stage data including terrain, hazards, and physics, and provides a lookup helper.",
  "frontend/src/hillclimb/ui/AuthAndSyncPanel.tsx": "Login and cloud sync panel handling Internet Identity auth, profile creation, and saving/loading game state.",
  "frontend/src/hillclimb/ui/DriveControls.tsx": "Renders throttle and brake buttons with pointer handling and safety cleanup on visibility or blur.",
  "frontend/src/hillclimb/ui/Hud.tsx": "Displays distance, coins, and fuel using themed HUD layout and a progress bar.",
  "frontend/src/hillclimb/ui/Overlay.tsx": "Wraps children in a centered card overlay for modal UI elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useFullscreen.ts": "Provides utilities to check, enter, exit, and toggle fullscreen mode with cross-browser support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout through a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines queries and mutations for room existence, creation, and state polling using the backend actor.",
  "frontend/src/index.css": "Defines global styles, theme variables, and layout classes for the Hill Climb UI using Tailwind.",
  "frontend/src/main.tsx": "Bootstraps the app with React, InternetIdentityProvider, and React Query.",
  "frontend/src/snake/DPad.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/snake/Joystick.tsx": "Implements a touch joystick with pointer tracking, clamped thumb movement, and steering filtering to emit angle changes.",
  "frontend/src/snake/joystickSteeringFilter.ts": "Implements joystick angle filtering with deadzone, smoothing, and hysteresis to produce stable steering output.",
  "frontend/src/snake/logic.ts": "Defines core Snake game world constants and utility functions and initializes player, AI snakes, and pickups.",
  "frontend/src/snake/multiplayer/MultiplayerConnectingScreen.tsx": "UI screen showing connection, reconnection, or failure states with retry and leave actions.",
  "frontend/src/snake/multiplayer/MultiplayerConnectionIndicator.tsx": "Displays reconnecting or disconnected status indicators during multiplayer sessions.",
  "frontend/src/snake/multiplayer/MultiplayerHUD.tsx": "Renders a leaderboard panel showing top-scoring snakes and highlighting the local player.",
  "frontend/src/snake/multiplayer/MultiplayerRoomCodePanel.tsx": "Panel displaying the multiplayer room code with clipboard copy support and error handling.",
  "frontend/src/snake/multiplayer/MultiplayerRoomContext.tsx": "Context provider managing multiplayer room creation, joining, leaving, and related state and errors.",
  "frontend/src/snake/multiplayer/MultiplayerSnakeCanvas.tsx": "Canvas renderer for multiplayer snake, drawing background, snakes, pickups, and handling camera/viewport transforms.",
  "frontend/src/snake/multiplayer/types.ts": "Type definitions for multiplayer snakes, game state, and room metadata.",
  "frontend/src/snake/multiplayer/urlRoomCode.ts": "Utility functions to read, write, clear, and build room-code URLs for multiplayer invites.",
  "frontend/src/snake/multiplayer/useInputSubmission.ts": "Hook that periodically submits the player's angle input to the backend when enabled.",
  "frontend/src/snake/multiplayer/useMultiplayerRoom.ts": "Thin wrapper hook exposing shared multiplayer room context.",
  "frontend/src/snake/multiplayer/useNickname.ts": "Hook managing nickname state with validation and localStorage persistence.",
  "frontend/src/snake/multiplayer/useRoomPolling.ts": "Polling hook fetching multiplayer room state, tracking failures, and reporting connection status.",
  "frontend/src/snake/pickupSprites.ts": "Defines food sprite sheet layout and helpers for selecting food sprites and pickup render sizes.",
  "frontend/src/snake/RotateToLandscapeOverlay.tsx": "Full‑screen overlay prompting users to rotate their device to landscape when visible.",
  "frontend/src/snake/SnakeBoosters.tsx": "Renders three disabled booster buttons with icons and counts using WZ asset sprites.",
  "frontend/src/snake/SnakeCanvas.tsx": "Canvas renderer for the snake game that draws the world, player, AI, background tiles, and pickups with DPR scaling and camera following.",
  "frontend/src/snake/SnakeHUD.tsx": "No summary available.",
  "frontend/src/snake/SnakeMainMenu.tsx": "Main menu UI for single‑player and multiplayer, handling nickname input, room creation/joining, and invite URL copying.",
  "frontend/src/snake/SnakeMinimap.tsx": "Draws a minimap showing player, AI snake positions, and the current viewport rectangle.",
  "frontend/src/snake/SnakeMissionCompleteOverlay.tsx": "Overlay displayed when a mission completes, showing a celebratory panel.",
  "frontend/src/snake/SnakeOverlays.tsx": "Provides pause and game‑over overlays with action buttons and basic stats.",
  "frontend/src/snake/SnakeScreen.tsx": "Main Snake game screen managing single-player and multiplayer modes, input handling, overlays, and viewport state.",
  "frontend/src/snake/types.ts": "Core types for single‑player snake game state, entities, pickups, missions, and world data.",
  "frontend/src/snake/useCanvasViewport.ts": "Hook computing responsive canvas viewport dimensions with DPR handling and resize stabilization.",
  "frontend/src/snake/useLandscapeOrientation.ts": "Hook that tracks and updates whether the device is in landscape orientation.",
  "frontend/src/snake/useSnakeGame.ts": "Main single‑player game loop hook handling snake movement, missions, AI, pickups, and timing.",
  "frontend/src/snake/wzAssets.ts": "Central mapping of asset paths for backgrounds, UI, boosters, and pickups.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, retrieving them with persistence, and removing parameters from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color system, animations, and plugin setup.",
  "project_state.json": "Tracks project metadata including summary, issues, required images, and implemented feature records."
}