{
  "backend/main.mo": "Placeholder backend actor with no functional logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend game files for reference.",
  "frontend/index.css": "Tailwind base styles defining CSS variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry point setting metadata, icons, and loading the React app.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Guide explaining how to publish the Snake PWA to the Google Play Store using TWA and Bubblewrap.",
  "frontend/public/.well-known/assetlinks.json": "Android asset links file allowing TWA to verify the app's domain.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, icons, theme, and display settings.",
  "frontend/public/sw.js": "Service worker handling caching, fetch interception, and cache versioning for offline support.",
  "frontend/src/App.tsx": "Root app component that renders SnakeScreen and registers the service worker.",
  "frontend/src/game/animations.ts": "Defines animation timing constants and a helper to wait for a given duration.",
  "frontend/src/game/assets.ts": "Maps static asset paths and includes a helper to compute sprite positions for candy types.",
  "frontend/src/game/audio/audioManager.ts": "Implements a simple audio manager for loading and playing sounds, initialized with silent placeholder audio.",
  "frontend/src/game/audio/sfx.ts": "Exports helper functions to play specific game sound effects using the audio manager.",
  "frontend/src/game/boardGeneration.ts": "Generates initial boards without matches, creates candies, checks for matches, and refills empty cells.",
  "frontend/src/game/boardReshuffle.ts": "Reshuffles the board until a layout with legal moves is produced, up to a retry limit.",
  "frontend/src/game/CandyTile.tsx": "Renders an individual candy tile with sprite selection, special candy handling, and interaction events.",
  "frontend/src/game/GameBoard.tsx": "Renders the full game grid, managing touch interactions, highlighting, selection, and swap attempts.",
  "frontend/src/game/GameScreen.tsx": "Main game screen combining HUD, board, controls, overlays, and audio toggle logic.",
  "frontend/src/game/gravity.ts": "Applies gravity to drop candies downward and returns the updated board plus fall information.",
  "frontend/src/game/interaction.ts": "Provides utilities for checking adjacency, validating positions, and getting neighboring cells.",
  "frontend/src/game/legalMoves.ts": "Detects whether any swap on the board would produce a match, indicating legal moves exist.",
  "frontend/src/game/matchDetection.ts": "Finds horizontal and vertical matches and checks if swapping two positions would create a match.",
  "frontend/src/game/Overlays.tsx": "Provides game over and level complete overlay components with icons, score display, and action buttons.",
  "frontend/src/game/progression.ts": "Generates level configuration and checks if a level’s target score has been reached.",
  "frontend/src/game/resolutionPipeline.ts": "Resolves matches, applies special candy creation and activations, clears cells, applies scoring, and returns updated board state.",
  "frontend/src/game/scoring.ts": "Calculates score values and determines target scores and starting moves for each level.",
  "frontend/src/game/specialActivations.ts": "Computes target cells for special candy effects and detects certain special-combo interactions.",
  "frontend/src/game/specialCandyRules.ts": "Determines which special candy to create from a match and applies its creation to the board.",
  "frontend/src/game/touchControls.ts": "Detects swipe direction based on touch movement exceeding a threshold.",
  "frontend/src/game/types.ts": "Defines core game constants and TypeScript types for candies, matches, animations, and game state.",
  "frontend/src/game/useMatch3Game.ts": "Main React hook managing match-3 game state, progression, cascades, animations, and audio effects.",
  "frontend/src/hooks/useActor.ts": "Creates and updates a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useFullscreen.ts": "Provides fullscreen API helpers with state tracking and cross-browser support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for loading, storing, and managing Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no backend queries for the game.",
  "frontend/src/index.css": "Tailwind-based global styles and theme variables plus layout and game screen styling.",
  "frontend/src/main.tsx": "App entry point wiring React, query client, and Internet Identity provider.",
  "frontend/src/snake/DPad.tsx": "Empty file placeholder for a directional pad component.",
  "frontend/src/snake/Joystick.tsx": "Implements on-screen joystick with pointer tracking and filtered angle output.",
  "frontend/src/snake/joystickSteeringFilter.ts": "Implements a joystick steering filter with deadzone, hysteresis, and angle smoothing for stable directional input.",
  "frontend/src/snake/logic.ts": "Defines world constants and core snake-game logic including distance math, wrap-around, snake creation, and initial game state setup.",
  "frontend/src/snake/pickupSprites.ts": "Maps pickups to sprite-sheet rectangles and provides size rules for rendering different pickup types.",
  "frontend/src/snake/RotateToLandscapeOverlay.tsx": "Overlay prompting users to rotate to landscape mode on mobile.",
  "frontend/src/snake/SnakeBoosters.tsx": "Renders disabled booster buttons using Worms Zone asset sprites.",
  "frontend/src/snake/SnakeCanvas.tsx": "Canvas renderer that draws the snake world, handling camera logic, wrapping, DPR scaling, and rendering sprites for background, snakes, food, and pickups.",
  "frontend/src/snake/SnakeHUD.tsx": "HUD showing leaderboard, mission progress, timer, and coin count using styled UI panels.",
  "frontend/src/snake/SnakeMainMenu.tsx": "Main menu screen with logo, instructions, and buttons to start the game or access customization.",
  "frontend/src/snake/SnakeMinimap.tsx": "Renders a minimap showing player, AI snakes, and viewport area on a small canvas using world scaling.",
  "frontend/src/snake/SnakeMissionCompleteOverlay.tsx": "Overlay panel displayed briefly when a mission is completed.",
  "frontend/src/snake/SnakeOverlays.tsx": "UI overlays for idle, pause, and game‑over states, displaying messages and action buttons.",
  "frontend/src/snake/SnakeScreen.tsx": "Main game screen orchestrating game state, input handling, viewport sizing, overlays, and rendering components.",
  "frontend/src/snake/types.ts": "Declares TypeScript interfaces for vectors, game entities, mission state, and overall snake game state.",
  "frontend/src/snake/useCanvasViewport.ts": "React hook that measures a container and outputs DPR-aware canvas viewport dimensions with resize stabilization.",
  "frontend/src/snake/useLandscapeOrientation.ts": "React hook detecting whether the device is in landscape orientation and updates state on orientation changes.",
  "frontend/src/snake/useSnakeGame.ts": "Main React game loop and state manager handling movement, missions, input angles, AI updates, and timing.",
  "frontend/src/snake/wzAssets.ts": "Centralized list of asset paths for Worms Zone–style graphics and UI elements.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, container rules, and enabling plugins for typography and queries.",
  "project_state.json": "Project metadata describing features, issues, and current request to increase gameplay screen size."
}