{
  "backend/main.mo": "Empty actor; no backend logic implemented.",
  "feature_evidence.json": "Feature evidence report linking features to modified frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing autogenerated summaries of various frontend game modules.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark mode UI styling.",
  "frontend/index.html": "Main HTML entry for the PWA including metadata, icons, manifest, and script loader.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Guide for packaging the PWA with Bubblewrap and publishing to Google Play Store.",
  "frontend/public/.well-known/assetlinks.json": "Android TWA asset links config authorizing an Android app via certificate fingerprint.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, theme, metadata, and standalone landscape display mode.",
  "frontend/public/sw.js": "Service worker implementing install, cache-first fetch, and activation logic for PWA assets.",
  "frontend/src/App.tsx": "Root React component registering the service worker and rendering SnakeScreen with Toaster.",
  "frontend/src/game/animations.ts": "Provides animation timing constants and a helper wait function.",
  "frontend/src/game/assets.ts": "Maps game asset image paths and includes a helper to compute candy sprite positions.",
  "frontend/src/game/audio/audioManager.ts": "Implements a simple audio manager with mute control and loads placeholder sound effects.",
  "frontend/src/game/audio/sfx.ts": "Convenience functions for playing specific game sound effects through the audio manager.",
  "frontend/src/game/boardGeneration.ts": "Generates initial boards without matches, creates candies, and refills empty cells.",
  "frontend/src/game/boardReshuffle.ts": "Reshuffles the board until it has legal moves, retrying up to ten times.",
  "frontend/src/game/CandyTile.tsx": "Renders individual candy tiles with sprite selection, special candy variants, and interaction handlers.",
  "frontend/src/game/GameBoard.tsx": "Renders the 8x8 candy grid and handles selection, highlighting, swipe gestures, and swap attempts.",
  "frontend/src/game/GameScreen.tsx": "Main game UI component rendering the board, HUD, audio controls, and overlays using useMatch3Game state.",
  "frontend/src/game/gravity.ts": "Applies gravity to the board, moving candies downward and reporting fall positions.",
  "frontend/src/game/interaction.ts": "Utilities for checking adjacency, validating positions, and getting directional neighbors.",
  "frontend/src/game/legalMoves.ts": "Determines if the board has any legal moves by simulating neighbor swaps.",
  "frontend/src/game/matchDetection.ts": "Finds horizontal and vertical matches and checks if a swap would produce a match.",
  "frontend/src/game/Overlays.tsx": "Defines game over and level complete overlay components with icons and action buttons.",
  "frontend/src/game/progression.ts": "Provides level configuration and checks if a level’s target score is met.",
  "frontend/src/game/resolutionPipeline.ts": "Resolves matches, handles special creation and activations, applies scoring, and returns updated board state.",
  "frontend/src/game/scoring.ts": "Defines scoring rules, target score scaling, and initial moves per level.",
  "frontend/src/game/specialActivations.ts": "Computes clear targets for special candies and detects special combo activations.",
  "frontend/src/game/specialCandyRules.ts": "No summary available.",
  "frontend/src/game/touchControls.ts": "No summary available.",
  "frontend/src/game/types.ts": "No summary available.",
  "frontend/src/game/useMatch3Game.ts": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useFullscreen.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "No summary available.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/main.tsx": "No summary available.",
  "frontend/src/snake/DPad.tsx": "No summary available.",
  "frontend/src/snake/Joystick.tsx": "Implements a touch joystick with pointer tracking, clamping, and angle smoothing using a steering filter.",
  "frontend/src/snake/joystickSteeringFilter.ts": "Implements joystick input filtering with deadzone, angle hysteresis, and smoothing to produce stable steering angles.",
  "frontend/src/snake/logic.ts": "Defines core game constants and functions for movement, wrapping, pickups, AI, and initial game state setup.",
  "frontend/src/snake/pickupSprites.ts": "Maps pickup IDs and types to sprite sheet regions and render sizes for food and coin pickups.",
  "frontend/src/snake/RotateToLandscapeOverlay.tsx": "Displays a fullscreen prompt asking the user to rotate their device to landscape mode.",
  "frontend/src/snake/SnakeBoosters.tsx": "Renders three disabled booster buttons with icons and counts using WZ asset backgrounds.",
  "frontend/src/snake/SnakeCanvas.tsx": "Draws the game world, player, AI snakes, and pickups on a canvas with DPR scaling and world wrapping.",
  "frontend/src/snake/SnakeHUD.tsx": "Shows leaderboard, mission progress, timer, and coin count using WZ HUD assets.",
  "frontend/src/snake/SnakeMainMenu.tsx": "Displays the game’s main menu with logo, instructions, and start/wardrobe buttons.",
  "frontend/src/snake/SnakeMinimap.tsx": "Renders a minimap showing player, AI snakes, and viewport bounds onto a small canvas.",
  "frontend/src/snake/SnakeMissionCompleteOverlay.tsx": "Simple overlay indicating mission completion before the next mission starts.",
  "frontend/src/snake/SnakeOverlays.tsx": "Provides pause and game‑over overlays showing status, stats, and action buttons.",
  "frontend/src/snake/SnakeScreen.tsx": "Top‑level game screen managing state, input, overlays, canvas rendering, and orientation/fullscreen behavior.",
  "frontend/src/snake/types.ts": "Declares TypeScript interfaces for vectors, snakes, pickups, missions, and overall game state.",
  "frontend/src/snake/useCanvasViewport.ts": "React hook that measures container size and DPR to provide stable canvas viewport dimensions.",
  "frontend/src/snake/useLandscapeOrientation.ts": "React hook that tracks whether the device is currently in landscape orientation.",
  "frontend/src/snake/useSnakeGame.ts": "Manages game loop, mission timers, input angles, and state updates for the snake game.",
  "frontend/src/snake/wzAssets.ts": "Centralizes asset paths for Worms Zone–style graphics including backgrounds, UI, and pickups.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugin setup for the project.",
  "project_state.json": "Defines project state for adjusting a Snake game to match reference images, listing existing features, a new feature request, and metadata."
}