{
  "backend/main.mo": "Implements multiplayer room management for a Snake game including room creation, activity tracking, timer toggling, and periodic game loop handling.",
  "feature_evidence.json": "Lists feature evidence mappings connecting requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions of all frontend source files related to the match‑3 and Snake game UI.",
  "frontend/index.css": "Defines Tailwind theme variable overrides for light and dark modes and applies base styling.",
  "frontend/index.html": "HTML entry point configuring meta tags, icons, manifest, and loading the main React script.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Guide explaining how to package and publish the Snake PWA as an Android app using TWA and Bubblewrap.",
  "frontend/public/.well-known/assetlinks.json": "Defines Android TWA asset links allowing the associated app to handle all URLs.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying icons, colors, metadata, and display settings for the Snake game.",
  "frontend/public/sw.js": "Service worker implementing caching, fetch interception, and cache versioning for offline support.",
  "frontend/src/App.tsx": "Root React component that renders the Snake screen and registers the PWA service worker.",
  "frontend/src/game/animations.ts": "Provides animation timing constants and a wait helper for delays.",
  "frontend/src/game/assets.ts": "Maps static asset paths and includes a helper to compute candy sprite positions.",
  "frontend/src/game/audio/audioManager.ts": "Implements a simple audio manager to load, play, and mute game sound effects.",
  "frontend/src/game/audio/sfx.ts": "Utility wrappers to trigger specific sound effects through the audio manager.",
  "frontend/src/game/boardGeneration.ts": "Generates initial boards without matches, creates candies, checks matches, and refills empty cells.",
  "frontend/src/game/boardReshuffle.ts": "Reshuffles the board until legal moves exist or attempts are exhausted.",
  "frontend/src/game/CandyTile.tsx": "Renders a single candy tile with special variant sprite handling and interaction events.",
  "frontend/src/game/GameBoard.tsx": "Renders the full game grid, handling tile interactions, highlighting, clearing, falling, and touch swipe logic.",
  "frontend/src/game/GameScreen.tsx": "Main game UI component rendering HUD, board, controls, and overlays using game state from useMatch3Game.",
  "frontend/src/game/gravity.ts": "Applies gravity to the board, moving candies downward and reporting fall events.",
  "frontend/src/game/interaction.ts": "Provides adjacency checks, position validation, and directional movement helpers.",
  "frontend/src/game/legalMoves.ts": "Determines whether any swap on the board would result in a valid match.",
  "frontend/src/game/matchDetection.ts": "Finds horizontal and vertical matches and checks whether a swap would create one.",
  "frontend/src/game/Overlays.tsx": "Defines Game Over and Level Complete overlay components with icons and action buttons.",
  "frontend/src/game/progression.ts": "Defines level configuration logic including target score and moves, plus level completion checks.",
  "frontend/src/game/resolutionPipeline.ts": "Resolves matches, applies special candy creation, handles activations, scoring, and returns updated board state.",
  "frontend/src/game/scoring.ts": "Calculates scoring for matches and defines target score and move formulas per level.",
  "frontend/src/game/specialActivations.ts": "Computes target cells for special candies and detects certain special candy combos.",
  "frontend/src/game/specialCandyRules.ts": "No summary available.",
  "frontend/src/game/touchControls.ts": "No summary available.",
  "frontend/src/game/types.ts": "No summary available.",
  "frontend/src/game/useMatch3Game.ts": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useFullscreen.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "No summary available.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/main.tsx": "No summary available.",
  "frontend/src/snake/DPad.tsx": "No summary available.",
  "frontend/src/snake/Joystick.tsx": "Implements a touch joystick with pointer tracking, clamping, and filtered angle output for controlling the snake.",
  "frontend/src/snake/joystickSteeringFilter.ts": "Implements a joystick steering filter with deadzone, hysteresis, and smoothing for stable angle input.",
  "frontend/src/snake/logic.ts": "Core Snake game logic including world constants, math helpers, pickup generation, and initial game state creation.",
  "frontend/src/snake/multiplayer/MultiplayerConnectingScreen.tsx": "Renders connection status UI for multiplayer joins, retries, and failures.",
  "frontend/src/snake/multiplayer/MultiplayerConnectionIndicator.tsx": "Small UI indicator showing reconnecting or disconnected multiplayer states.",
  "frontend/src/snake/multiplayer/MultiplayerHUD.tsx": "Displays a leaderboard panel showing top-scoring snakes with the local player highlighted.",
  "frontend/src/snake/multiplayer/MultiplayerRoomCodePanel.tsx": "UI panel showing the current room code with clipboard copy support and error feedback.",
  "frontend/src/snake/multiplayer/MultiplayerSnakeCanvas.tsx": "Canvas renderer for multiplayer mode drawing snakes, pickups, and world terrain with wraparound and camera logic.",
  "frontend/src/snake/multiplayer/types.ts": "Type definitions for multiplayer snakes, game state, and room info.",
  "frontend/src/snake/multiplayer/urlRoomCode.ts": "Helper functions to read, write, and clear room codes in the URL for invite links.",
  "frontend/src/snake/multiplayer/useInputSubmission.ts": "Periodically submits the player's current angle to the backend while in a multiplayer room.",
  "frontend/src/snake/multiplayer/useMultiplayerRoom.ts": "Manages creating, joining, leaving, and tracking status/errors for multiplayer rooms.",
  "frontend/src/snake/multiplayer/useNickname.ts": "Stores, validates, and persists the player's nickname with length checks.",
  "frontend/src/snake/multiplayer/useRoomPolling.ts": "Polls the backend for multiplayer room state and tracks connection status and failures.",
  "frontend/src/snake/pickupSprites.ts": "Defines sprite rectangles and helpers for selecting and sizing pickup visuals.",
  "frontend/src/snake/RotateToLandscapeOverlay.tsx": "Shows a fullscreen prompt instructing users to rotate their device to landscape mode.",
  "frontend/src/snake/SnakeBoosters.tsx": "Renders three disabled booster buttons with icons and counts using game asset sprites.",
  "frontend/src/snake/SnakeCanvas.tsx": "Draws the game world, player, AI, food, and environment to a canvas with DPR scaling, wrapping, and camera logic.",
  "frontend/src/snake/SnakeHUD.tsx": "Displays leaderboard and mission progress panels using game state values and asset images.",
  "frontend/src/snake/SnakeMainMenu.tsx": "Provides the main menu UI with nickname handling, room creation/joining, and game mode selection.",
  "frontend/src/snake/SnakeMinimap.tsx": "Draws a small minimap showing world boundaries, snake positions, and the viewport box.",
  "frontend/src/snake/SnakeMissionCompleteOverlay.tsx": "Shows a simple mission-complete overlay with celebratory text.",
  "frontend/src/snake/SnakeOverlays.tsx": "Contains pause and game-over overlays with actions and basic game stats.",
  "frontend/src/snake/SnakeScreen.tsx": "Main Snake game screen handling single-player and multiplayer modes, UI overlays, and rendering state setup.",
  "frontend/src/snake/types.ts": "Defines core game types including snakes, pickups, game state, and mission state.",
  "frontend/src/snake/useCanvasViewport.ts": "Computes responsive canvas viewport dimensions with DPR support and resize stabilization.",
  "frontend/src/snake/useLandscapeOrientation.ts": "Tracks whether the device is currently in landscape orientation.",
  "frontend/src/snake/useSnakeGame.ts": "Runs the main game loop, handles mission timing, controls, and snake movement logic.",
  "frontend/src/snake/wzAssets.ts": "Provides centralized paths to Worms Zone–style asset images.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, containers, animations, and plugins.",
  "project_state.json": "Holds current project state describing needed multiplayer room code join flow and removal of a right‑side coin image. Lists existing features, pending requests, and known UI issues."
}