{
  "backend/main.mo": "Placeholder backend actor with no functional logic; backend not involved in joystick changes.",
  "feature_evidence.json": "Feature evidence report listing three snake‑game fixes referencing two frontend snake logic files.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend match‑3 game files used for build reference.",
  "frontend/index.css": "Tailwind base/theme variable definitions and global color tokens for light and dark modes.",
  "frontend/index.html": "Root HTML document loading the PWA manifest, icons, and main React entry point.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Guide explaining how to package and publish the Snake PWA to Google Play using TWA and Bubblewrap.",
  "frontend/public/.well-known/assetlinks.json": "Android asset links config enabling TWA domain association for the Android app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing precache, runtime cache, and network‑first/offline fallback logic.",
  "frontend/src/App.tsx": "Root React component registering the service worker and rendering the Snake game UI.",
  "frontend/src/game/animations.ts": "Defines animation timing constants and a helper wait function.",
  "frontend/src/game/assets.ts": "Maps asset file paths and provides a helper to compute candy sprite positions.",
  "frontend/src/game/audio/audioManager.ts": "Implements a simple audio manager with sound loading, playback, and mute control, initialized with silent placeholder sounds.",
  "frontend/src/game/audio/sfx.ts": "Exports helper functions to play specific sound effects through the audio manager.",
  "frontend/src/game/boardGeneration.ts": "Generates initial and refilled boards, ensuring no immediate matches and creating candies with unique IDs.",
  "frontend/src/game/boardReshuffle.ts": "Reshuffles board until it produces legal moves, retrying up to a limit.",
  "frontend/src/game/CandyTile.tsx": "Renders an individual candy tile with sprite selection, special candy visuals, and input handlers.",
  "frontend/src/game/GameBoard.tsx": "Renders the candy grid, manages touch swipe detection, and triggers cell selection and swaps.",
  "frontend/src/game/GameScreen.tsx": "Main game UI component handling HUD, board rendering, overlays, audio mute toggle, and basic game actions.",
  "frontend/src/game/gravity.ts": "Applies gravity to drop candies downward and returns the updated board with fall metadata.",
  "frontend/src/game/interaction.ts": "Utility functions for adjacency checks, position validation, and directional movement.",
  "frontend/src/game/legalMoves.ts": "Determines whether any swap on the board would produce a match.",
  "frontend/src/game/matchDetection.ts": "Detects horizontal and vertical matches and checks whether a swap would create a match.",
  "frontend/src/game/Overlays.tsx": "Provides Game Over and Level Complete overlay components with icons and action buttons.",
  "frontend/src/game/progression.ts": "Generates level configuration and checks if target score has been reached.",
  "frontend/src/game/resolutionPipeline.ts": "Resolves matches, creates specials, clears candies, triggers special activations, and computes score gained.",
  "frontend/src/game/scoring.ts": "Provides score calculation, level target scoring, and initial move counts.",
  "frontend/src/game/specialActivations.ts": "Computes areas affected by special candies and detects certain special candy combos.",
  "frontend/src/game/specialCandyRules.ts": "Defines logic for determining special candies from matches and applies special candy creation to the board.",
  "frontend/src/game/touchControls.ts": "Detects swipe gestures based on movement thresholds and returns a directional result.",
  "frontend/src/game/types.ts": "Declares core Match-3 game types, constants, and interfaces for candies, matches, animations, and game state.",
  "frontend/src/game/useMatch3Game.ts": "Implements the main Match-3 game state hook, handling board setup, moves, cascades, scoring, and level progression.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useFullscreen.ts": "Provides a hook to enter, exit, and toggle fullscreen mode with cross-browser support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook indicating no backend queries are used in the game.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, and layout styling for the game's UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/snake/DPad.tsx": "Empty file with no implementation.",
  "frontend/src/snake/Joystick.tsx": "Implements a draggable on-screen joystick that emits filtered angle updates using SteeringFilter and handles pointer events.",
  "frontend/src/snake/joystickSteeringFilter.ts": "Defines a steering filter applying deadzone, smoothing, and hysteresis to joystick input to produce stable angle output.",
  "frontend/src/snake/logic.ts": "Contains world constants and game logic utilities for movement, angle math, wrapping, and initializing snakes and pickups.",
  "frontend/src/snake/SnakeCanvas.tsx": "Renders the snake game world onto a canvas, drawing background tiles, grid, pickups, and snakes with camera zoom and translation.",
  "frontend/src/snake/SnakeOverlays.tsx": "Provides UI overlays for idle, paused, and game-over states with icons, stats, and action buttons.",
  "frontend/src/snake/SnakeScreen.tsx": "Composes the full snake game UI including header, HUD, canvas, joystick, overlays, and fullscreen controls.",
  "frontend/src/snake/types.ts": "Declares TypeScript types for vectors, snakes, pickups, game state, and status values.",
  "frontend/src/snake/useSnakeGame.ts": "React hook implementing the Snake game loop, updating movement, AI, collisions, pickups, and applying turn‑rate and delta‑time limits.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Project state describing bug‑fix goals, feature requests, and known issues for the Snake Arena game."
}