{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Structured report describing implemented PWA-related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend game modules and assets for reference.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme variables and base styling.",
  "frontend/index.html": "Main HTML entry point linking the PWA manifest, icons, and loading the React app.",
  "frontend/PLAY_STORE_TWA_GUIDE.md": "Guide explaining how to package the Snake PWA into an Android App Bundle using Bubblewrap and TWA.",
  "frontend/public/.well-known/assetlinks.json": "Template asset links file used for Android TWA verification containing placeholder package and certificate.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, icons, colors, and standalone display settings.",
  "frontend/public/sw.js": "Service worker providing offline caching, precaching, runtime caching, and navigation handling.",
  "frontend/src/App.tsx": "Root React component rendering SnakeScreen and registering the service worker.",
  "frontend/src/game/animations.ts": "Exports animation timing constants and a wait helper for async delays.",
  "frontend/src/game/assets.ts": "Maps image asset paths and provides a helper to compute candy sprite positions.",
  "frontend/src/game/audio/audioManager.ts": "Implements a basic audio manager with mute, play, and sound loading using silent placeholders.",
  "frontend/src/game/audio/sfx.ts": "Wrapper functions triggering specific game sound effects via the audio manager.",
  "frontend/src/game/boardGeneration.ts": "Generates initial boards without immediate matches and refills empty cells with new candies.",
  "frontend/src/game/boardReshuffle.ts": "Reshuffles the board until it has at least one legal move.",
  "frontend/src/game/CandyTile.tsx": "UI component rendering a candy tile with sprite selection and special candy visuals.",
  "frontend/src/game/GameBoard.tsx": "Renders the game board grid, manages touch/mouse interactions, and triggers swaps and selection.",
  "frontend/src/game/GameScreen.tsx": "Main React screen composing the match-3 UI, HUD, board, audio mute, restart, and overlays.",
  "frontend/src/game/gravity.ts": "Applies gravity to drop candies downward and returns resulting fall movements.",
  "frontend/src/game/interaction.ts": "Utility functions for adjacency checks, position validation, and directional neighbor lookup.",
  "frontend/src/game/legalMoves.ts": "Scans the board for any swap that would create a match.",
  "frontend/src/game/matchDetection.ts": "Finds horizontal and vertical matches and checks whether a swap would produce a match.",
  "frontend/src/game/Overlays.tsx": "Defines game-over and level-complete overlay components with icons and action buttons.",
  "frontend/src/game/progression.ts": "Provides level configuration and checks if a level’s target score is met.",
  "frontend/src/game/resolutionPipeline.ts": "Resolves matches, applies special candy logic, scoring, and handles special activations.",
  "frontend/src/game/scoring.ts": "Defines scoring for clears and computes level target scores and initial moves.",
  "frontend/src/game/specialActivations.ts": "Computes cleared targets for special candies and detects special-combo activations.",
  "frontend/src/game/specialCandyRules.ts": "Creates special candies from matches and applies them to the board by clearing matched tiles and assigning the special type.",
  "frontend/src/game/touchControls.ts": "Detects swipe direction based on touch start and end coordinates with a distance threshold.",
  "frontend/src/game/types.ts": "Defines core game types such as candies, matches, game state, and constants like board size and candy types.",
  "frontend/src/game/useMatch3Game.ts": "Main hook managing Match-3 gameplay state, handling moves, cascades, scoring, levels, animations, and sounds.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no backend queries since the game is fully client-side.",
  "frontend/src/index.css": "Tailwind-based global styles defining color palette, layout, and UI styling for the game interface.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/snake/DPad.tsx": "Renders a directional pad component for controlling snake movement via buttons or touch.",
  "frontend/src/snake/logic.ts": "Implements core Snake logic including movement, food generation, collision detection, and speed rules.",
  "frontend/src/snake/SnakeCanvas.tsx": "Canvas renderer for the Snake game, drawing the grid, food, and snake with basic visual effects.",
  "frontend/src/snake/SnakeOverlays.tsx": "Defines three UI overlay components (GameOver, Pause, Idle) for displaying game state messages and action buttons.",
  "frontend/src/snake/SnakeScreen.tsx": "Main Snake game screen wiring game state, keyboard input, HUD, canvas rendering, overlays, and D-pad controls.",
  "frontend/src/snake/types.ts": "Contains TypeScript types for directions, positions, game status, and overall SnakeGameState.",
  "frontend/src/snake/useSnakeGame.ts": "Custom hook managing Snake game state, game loop, movement, collisions, food handling, and control actions.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended theme colors, animations, plugins, and container settings.",
  "project_state.json": "Project metadata describing current feature set, issues, and required assets for the Snake game and Android packaging."
}