{
  "kind": "build_request",
  "title": "Fix Snake Arena glitches and tune default snake speed to medium",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix Snake Arena movement/physics glitches by correcting the snake segment follow logic so segments track the previous segment smoothly (no jittering, teleporting, or kinks) during normal play, turning, and world-edge wrap-around.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In this game there was so many glitches so please fix all the glitches"
        ]
      },
      "acceptanceCriteria": [
        "During continuous movement, the snake body follows the head with consistent spacing and without visible jitter or sudden jumps.",
        "Turning the snake does not cause segments to overlap, lag incorrectly, or detach visually from the body.",
        "Wrapping around world boundaries (crossing x/y edges) does not produce segment snapping or discontinuities."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Tune the default player snake speed so it is reliably “medium” (not too fast and not too slow) across different device frame rates by adjusting the snake speed constants and/or delta-time scaling in the Snake Arena loop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "and the speed of snake is not very the speed of snake is medium"
        ]
      },
      "acceptanceCriteria": [
        "The player snake movement speed feels consistent on both high-refresh and low-refresh devices (no unintended speed-ups/slow-downs).",
        "Default speed is set to a medium pace and remains stable while steering with the joystick.",
        "AI snakes continue to move and behave correctly at the tuned speed (no new collision or steering regressions)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix gameplay glitches related to pickup generation and collection consistency by ensuring pickup IDs are unique and that pickups do not flicker, duplicate unexpectedly, or reappear due to identifier collisions or state update issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In this game there was so many glitches so please fix all the glitches"
        ]
      },
      "acceptanceCriteria": [
        "Pickups maintain stable identity during a play session (no duplicate IDs leading to rendering/state inconsistencies).",
        "Collecting pickups reliably increases score and length exactly once per pickup collected.",
        "Pickup respawn logic maintains the intended pickup count behavior without sudden mass duplication or disappearance."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend remains a single Motoko actor; avoid backend changes unless strictly required for these glitch fixes."
  ],
  "nonGoals": [
    "Add new game modes, levels, or multiplayer/real-time features.",
    "Add new authentication methods beyond existing project capabilities.",
    "Redesign the entire UI/visual theme (only fix functional glitches and speed tuning)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}