{
  "kind": "build_request",
  "title": "Adjust Snake gameplay to match reference image with more open space",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Match the gameplay framing to the uploaded reference screenshots by increasing the amount of visible empty arena space around the player during Snake gameplay (i.e., zoom the camera out so the snake occupies a smaller portion of the screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make like this game and there was so many space in this game image make like this"
        ]
      },
      "acceptanceCriteria": [
        "During gameplay, the camera shows noticeably more arena area around the player than before (snake appears smaller on screen).",
        "No visual stretching occurs; canvas remains crisp and correctly scaled on different device pixel ratios.",
        "Gameplay remains playable (snake speed/controls unchanged) after the zoom/framing adjustment."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Snake gameplay UI layout to feel more like the reference screenshots by reducing on-screen visual clutter and preserving a clean, spacious playfield (e.g., keep HUD elements compact and out of the center area, and avoid heavy frames that visually shrink the arena).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make like this game and there was so many space in this game image make like this"
        ]
      },
      "acceptanceCriteria": [
        "HUD panels do not obstruct the central play area; they stay anchored to screen edges/corners.",
        "The playfield visually reads as a large open arena (no thick borders or heavy container styling that makes the arena feel boxed-in).",
        "Layout remains responsive on mobile and desktop without overlapping critical controls (joystick, overlays, HUD)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply a cohesive visual theme aligned with the reference screenshots: a clean arcade arena with a flat/mostly-uniform blue field and subtle texture, with minimalistic, lightweight UI chrome used consistently across gameplay screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make like this game and there was so many space in this game image make like this"
        ]
      },
      "acceptanceCriteria": [
        "Gameplay background reads as predominantly blue with subtle texture/grain; it does not look overly dark or busy.",
        "UI elements (HUD, overlays, buttons) use consistent styling and do not visually dominate the arena.",
        "No user-facing text is introduced in a language other than English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend is single-actor Motoko; do not add additional backend services."
  ],
  "nonGoals": [
    "Adding new game modes, new controls, multiplayer, or networking.",
    "Implementing third-party authentication or external APIs.",
    "Changing core Snake game rules, scoring, or mission logic beyond what is necessary to achieve the requested spacious visual framing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}