{
  "kind": "build_request",
  "title": "Add multiplayer room code join UI and remove right-side coin HUD panel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the main menu includes a clearly visible multiplayer \"Join with Code\" flow so a player can enter a room code and join another player’s room.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In this photo there was no room code to join another player"
        ]
      },
      "acceptanceCriteria": [
        "On the Multiplayer tab in the main menu, there is an input to enter a room code and a Join action button.",
        "The Join action triggers the existing multiplayer join logic and transitions into multiplayer mode on success.",
        "If the code is empty/invalid, the Join action is disabled or shows a clear validation message in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Display the current multiplayer room code in-game (during multiplayer gameplay) in a persistent, readable panel so players can see/share the room code at any time.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "In this photo there was no room code to join another player"
        ]
      },
      "acceptanceCriteria": [
        "When in multiplayer gameplay, a \"Room Code\" panel is visible and shows the active room code.",
        "The room code panel includes a copy-to-clipboard action with clear feedback (e.g., copied state).",
        "The room code panel remains visible in both landscape and portrait (unless an intentional full-screen blocking overlay is shown)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the right-side coin photo/image from the gameplay UI (the right/top coin HUD panel), while keeping other HUD elements functional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the right side photo of coin"
        ]
      },
      "acceptanceCriteria": [
        "The standalone coin counter HUD panel on the right side is no longer rendered in single-player gameplay.",
        "No coin icon/coin-image panel appears on the right side after the change (as seen in the provided screenshot).",
        "Leaderboard and mission HUD (if present) continue to render correctly and are not overlapped by leftover spacing/styling."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components); compose them instead.",
    "Backend must remain a single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Changing game logic, scoring, missions, or coin mechanics.",
    "Adding real-time chat or external integrations for multiplayer invites."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}