{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Multiplayer join-by-code UI improvements, in-game room code panel, and remove right-side coin HUD",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add/ensure a clearly visible Multiplayer “Join with Code” flow in the main menu with validation and existing join behavior.",
      "acceptanceCriteria": [
        "On the Multiplayer tab in the main menu, there is an input to enter a room code and a Join action button.",
        "The Join action triggers the existing multiplayer join logic and transitions into multiplayer mode on success.",
        "If the code is empty/invalid, the Join action is disabled or shows a clear validation message in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/SnakeMainMenu.tsx",
          "operation": "modify",
          "description": "Improve the Multiplayer tab’s “Join with Code” section: keep the existing join logic wiring, add clear client-side validation (empty/invalid format), normalize input (trim/uppercasing/optional MP- prefix handling), and ensure an English validation message is shown when invalid. Use shadcn-ui components (Input, Button, Label, Card/Tabs) to keep the join flow prominent and consistent. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show the active multiplayer room code in-game with a persistent panel and copy-to-clipboard feedback.",
      "acceptanceCriteria": [
        "When in multiplayer gameplay, a \"Room Code\" panel is visible and shows the active room code.",
        "The room code panel includes a copy-to-clipboard action with clear feedback (e.g., copied state).",
        "The room code panel remains visible in both landscape and portrait (unless an intentional full-screen blocking overlay is shown)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/multiplayer/MultiplayerRoomCodePanel.tsx",
          "operation": "modify",
          "description": "Enhance the existing room code panel to provide clearer copy-to-clipboard feedback (e.g., temporary “Copied” text and/or accessible aria-live status) and handle clipboard errors gracefully while keeping the panel readable and persistent. Use shadcn-ui Button for the copy action. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust/verify the room code panel styling so it remains readable and visible across orientations (including portrait), without being obscured by other overlays/controls except intentional full-screen blocking overlays."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove the right-side coin HUD panel/image from single-player gameplay while keeping other HUD elements intact.",
      "acceptanceCriteria": [
        "The standalone coin counter HUD panel on the right side is no longer rendered in single-player gameplay.",
        "No coin icon/coin-image panel appears on the right side after the change (as seen in the provided screenshot).",
        "Leaderboard and mission HUD (if present) continue to render correctly and are not overlapped by leftover spacing/styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/SnakeHUD.tsx",
          "operation": "modify",
          "description": "Remove (or conditionally suppress) rendering of the right/top coin counter HUD panel in single-player gameplay, leaving the leaderboard and mission HUD unchanged and functional."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update HUD layout styles as needed to ensure removing the coin HUD does not leave awkward spacing or cause overlap with other HUD elements (leaderboard/mission) and that the right-side area remains clean."
        }
      ]
    }
  ]
}