{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Snake Arena: smooth segment following, frame-rate-stable medium speed, and stable pickup identities",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Correct snake segment follow logic to remove jitter/teleporting and handle wrap-around smoothly.",
      "acceptanceCriteria": [
        "During continuous movement, the snake body follows the head with consistent spacing and without visible jitter or sudden jumps.",
        "Turning the snake does not cause segments to overlap, lag incorrectly, or detach visually from the body.",
        "Wrapping around world boundaries (crossing x/y edges) does not produce segment snapping or discontinuities."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/logic.ts",
          "operation": "modify",
          "description": "Fix the segment-follow implementation to use each segment’s own prior position (not the previous segment’s), maintain consistent SEGMENT_SPACING, and compute follow vectors using toroidal (wrap-aware) shortest deltas so edge wrap-around does not create long-distance snaps. Keep movement deterministic and smooth during straight motion and turns."
        },
        {
          "path": "frontend/src/snake/useSnakeGame.ts",
          "operation": "modify",
          "description": "Adjust the game loop integration as needed to support the corrected follow logic under wrap-around (e.g., ensure deltaTime clamping/step handling does not amplify segment jitter) while preserving current pause/restart behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Tune default snake speed to a medium pace and make movement consistent across device frame rates.",
      "acceptanceCriteria": [
        "The player snake movement speed feels consistent on both high-refresh and low-refresh devices (no unintended speed-ups/slow-downs).",
        "Default speed is set to a medium pace and remains stable while steering with the joystick.",
        "AI snakes continue to move and behave correctly at the tuned speed (no new collision or steering regressions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/useSnakeGame.ts",
          "operation": "modify",
          "description": "Update the Snake Arena loop timing to be frame-rate independent (e.g., clamp large deltaTime values and/or use a fixed-step accumulator) so the effective movement per real-world second is stable on both low- and high-refresh displays."
        },
        {
          "path": "frontend/src/snake/logic.ts",
          "operation": "modify",
          "description": "Retune BASE_SPEED (and any related speed constants/scaling) to a reliable medium default when combined with the updated delta-time handling, ensuring both the player and AI snakes move correctly at the new baseline."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Stabilize pickup generation/collection by guaranteeing unique pickup IDs and preventing ID-collision-driven flicker/duplication.",
      "acceptanceCriteria": [
        "Pickups maintain stable identity during a play session (no duplicate IDs leading to rendering/state inconsistencies).",
        "Collecting pickups reliably increases score and length exactly once per pickup collected.",
        "Pickup respawn logic maintains the intended pickup count behavior without sudden mass duplication or disappearance."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/logic.ts",
          "operation": "modify",
          "description": "Replace the current pickup ID scheme with a collision-resistant unique ID generator that remains unique across multiple generatePickups calls in the same session. Update pickup generation to avoid accidental identifier reuse during respawns."
        },
        {
          "path": "frontend/src/snake/useSnakeGame.ts",
          "operation": "modify",
          "description": "Update pickup respawn and state update flow to align with the new pickup ID generation, ensuring respawn adds only the required number of pickups and that a pickup can only be collected once (no double-awards due to state inconsistencies)."
        }
      ]
    }
  ]
}