{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Snake Game PWA + TWA (Bubblewrap) readiness (frontend-only)",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Add and wire a web app manifest so the Snake game is installable and launches in standalone mode with consistent app naming.",
      "acceptanceCriteria": [
        "A valid web app manifest file is added under the frontend public assets and is served at runtime.",
        "The manifest includes at minimum: name, short_name, start_url, scope, display=standalone, theme_color, background_color, and icons.",
        "The manifest is referenced from the HTML entry point so browsers detect it as installable.",
        "User-facing app name used for install is \"Snake Game\" (or a single consistent English name) rather than \"Candy Crush Game\".",
        "The installed PWA launches directly into the Snake experience (current app behavior preserved)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Create a valid PWA manifest for \"Snake Game\" with display=standalone, start_url/scope pointing at the existing Snake app entry, theme_color/background_color aligned to the app theme, and icon references (filled/verified in REQ-34)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Wire the manifest into the HTML entry point (add the manifest link and relevant PWA meta such as theme-color) and change the document title from \"Candy Crush Game\" to the consistent install name \"Snake Game\" to match PWA install prompts."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Add required PWA icon assets (including maskable) and reference them correctly from the manifest.",
      "acceptanceCriteria": [
        "At least one 192x192 and one 512x512 icon are available and referenced by the manifest.",
        "At least one maskable icon is available and referenced by the manifest with purpose \"maskable\".",
        "Icons are committed as static files and load successfully when requested directly by URL in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/pwa-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add the generated 192x192 PWA launcher icon as a static asset at this exact path."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 PWA launcher icon as a static asset at this exact path."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon-maskable.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 maskable PWA icon as a static asset at this exact path."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Update the manifest icon list to reference: frontend/public/assets/generated/pwa-icon.dim_192x192.png, frontend/public/assets/generated/pwa-icon.dim_512x512.png, and frontend/public/assets/generated/pwa-icon-maskable.dim_512x512.png (with purpose \"maskable\"), ensuring paths/sizes/types are correct."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Add a service worker for basic offline support and register it from the client at runtime.",
      "acceptanceCriteria": [
        "A service worker is present and registered in the client at runtime.",
        "With the service worker active, a previously loaded session can start the app while offline and still render the Snake UI (app shell) without a blank page.",
        "No backend calls are required for app startup; the game remains playable as it is today."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Implement a service worker that precaches the app shell and core static assets needed to render the Snake UI and uses a safe caching strategy so the app can load while offline after an initial online visit."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the service worker (frontend/public/sw.js) at runtime (e.g., on mount) without modifying immutable files, and ensure registration failures do not break game startup."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add an in-repo guide explaining how to package the deployed HTTPS PWA into an Android App Bundle (AAB) using Bubblewrap/TWA.",
      "acceptanceCriteria": [
        "Documentation exists in the repository describing step-by-step how to package the deployed HTTPS PWA into an AAB using Bubblewrap/TWA.",
        "The guide explicitly lists what the developer must supply (package name/applicationId, keystore, SHA-256 cert fingerprint) and where to place assetlinks.json.",
        "The guide uses English for all instructions and does not assume external backend services beyond the already deployed HTTPS site."
      ],
      "file_operations": [
        {
          "path": "frontend/PLAY_STORE_TWA_GUIDE.md",
          "operation": "create",
          "description": "Create an English Bubblewrap/TWA packaging guide covering prerequisites, required values to supply (applicationId/package name, signing key/keystore, SHA-256 cert fingerprint), how to generate an AAB, and how the deployed HTTPS PWA URL and Digital Asset Links are used for verification."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add a Digital Asset Links (assetlinks.json) template under the standard well-known location and document how to fill it in for TWA verification.",
      "acceptanceCriteria": [
        "A template asset links file is added at the standard path \"/.well-known/assetlinks.json\" within the frontend public assets so it is served by the frontend hosting.",
        "The packaging guide (REQ-36) explains how to edit the template with the correct package name and SHA-256 fingerprint after signing setup.",
        "Requesting the asset links URL in a browser returns valid JSON content (even if placeholder values are present until filled)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/.well-known/assetlinks.json",
          "operation": "create",
          "description": "Add a valid JSON template for Digital Asset Links at the standard well-known path, using clearly marked placeholder values for the Android package name and SHA-256 signing certificate fingerprint."
        },
        {
          "path": "frontend/PLAY_STORE_TWA_GUIDE.md",
          "operation": "modify",
          "description": "Add/extend a section explaining how to update frontend/public/.well-known/assetlinks.json with the real package name and SHA-256 fingerprint, and where it must be hosted so Android can verify the TWA relationship."
        }
      ]
    }
  ]
}