{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Snake gameplay: zoomed-out framing and cleaner blue arena UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Zoom the Snake gameplay camera out to show more empty arena space around the player while keeping DPR-crisp canvas rendering.",
      "acceptanceCriteria": [
        "During gameplay, the camera shows noticeably more arena area around the player than before (snake appears smaller on screen).",
        "No visual stretching occurs; canvas remains crisp and correctly scaled on different device pixel ratios.",
        "Gameplay remains playable (snake speed/controls unchanged) after the zoom/framing adjustment."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/SnakeScreen.tsx",
          "operation": "modify",
          "description": "Reduce gameplay zoom (currently the ZOOM constant) and, if needed, make zoom responsive to viewport size so the arena shows more open space without affecting movement logic. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/snake/SnakeCanvas.tsx",
          "operation": "modify",
          "description": "Audit the camera/view calculations that use zoom (viewWidth/viewHeight, worldToScreen) to ensure the zoom-out change preserves crisp DPR scaling and avoids any stretching artifacts; keep snake speed/controls unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/snake/SnakeMinimap.tsx",
          "operation": "modify",
          "description": "Ensure minimap viewport indicator stays accurate after the zoom change (it currently receives zoom from SnakeScreen) so the displayed visible region matches the new framing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Clean up the Snake gameplay layout to maximize readable playfield space and keep HUD/controls compact and edge-anchored.",
      "acceptanceCriteria": [
        "HUD panels do not obstruct the central play area; they stay anchored to screen edges/corners.",
        "The playfield visually reads as a large open arena (no thick borders or heavy container styling that makes the arena feel boxed-in).",
        "Layout remains responsive on mobile and desktop without overlapping critical controls (joystick, overlays, HUD)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/SnakeScreen.tsx",
          "operation": "modify",
          "description": "Rework gameplay chrome so it does not consume vertical layout space (e.g., move pause/restart/fullscreen controls into an in-arena corner overlay instead of a full-width header; avoid heavy framing around the playfield). Continue using the existing shadcn-ui Button component for controls (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/snake/SnakeHUD.tsx",
          "operation": "modify",
          "description": "Make HUD more compact and less obtrusive: reduce panel padding/typography, consider collapsing/shortening the leaderboard presentation, and remove/avoid heavyweight panel background images that visually shrink the arena. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust gameplay layout CSS to reduce visual clutter: soften/remove thick borders/shadows around the gameplay container, tighten HUD sizing, and refine responsive positioning to prevent overlaps with joystick/boosters/minimap across breakpoints. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply a cohesive arcade-blue arena theme with subtle texture and consistent lightweight UI styling across Snake gameplay screens.",
      "acceptanceCriteria": [
        "Gameplay background reads as predominantly blue with subtle texture/grain; it does not look overly dark or busy.",
        "UI elements (HUD, overlays, buttons) use consistent styling and do not visually dominate the arena.",
        "No user-facing text is introduced in a language other than English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/SnakeCanvas.tsx",
          "operation": "modify",
          "description": "Tune the arena rendering for a clean blue field with subtle texture: adjust background tiling usage and/or soften any over-strong overlays (e.g., grid opacity) so the field remains predominantly blue and uncluttered. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/snake/SnakeOverlays.tsx",
          "operation": "modify",
          "description": "Align pause/game-over overlays with the minimal lightweight chrome style (subtle translucency, consistent radius/typography) without introducing non-English text. Continue using existing shadcn-ui components (e.g., Button) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Unify Snake gameplay styling tokens and classes for a minimal arcade-blue look: lightweight panel backgrounds, consistent corner radius, and restrained shadows so UI does not dominate the arena. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/snake/wzAssets.ts",
          "operation": "modify",
          "description": "If needed for the new minimal chrome approach, stop relying on heavy HUD frame assets by adjusting which generated assets are referenced for HUD/minimap styling (keeping the arena background tile as the primary texture). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}