{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resize Snake Arena gameplay container to medium and keep canvas viewport scaling accurate",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Increase the Snake Arena gameplay container to a medium-sized responsive layout that uses more viewport space on desktop/tablet while still fully fitting within the viewport and maintaining 16:9.",
      "acceptanceCriteria": [
        "On desktop-sized viewports (e.g., ~1366×768 and larger), the gameplay container renders noticeably larger than before (medium-sized) while still fully visible without requiring scrolling.",
        "On mobile viewports (<=768px), the layout remains stable and does not overflow the viewport; the game container still fits within the visible area.",
        "The gameplay container keeps a sensible game aspect ratio (currently 16:9) and does not become excessively small due to the aspect-ratio constraint."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the responsive sizing rules for the `.game-container.snake-game-container` (and any necessary gameplay layout wrappers such as `.game-screen-gameplay .game-main`) so the 16:9 container scales up to a medium size on desktop/tablet (using viewport-based max sizing / clamps) while guaranteeing it always fits fully within the visible viewport (no scrollbars) and remains stable on mobile breakpoints."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure canvas viewport measurement and rendering remain accurate and crisp after the gameplay container size increase, with efficient resize handling.",
      "acceptanceCriteria": [
        "After resizing the gameplay container, the canvas fills the game board container with no letterboxing gaps caused by mismatched width/height styles.",
        "Resizing the browser window updates the canvas dimensions appropriately (no stale sizing), and performance does not degrade due to excessive resize re-renders."
      ],
      "file_operations": [
        {
          "path": "frontend/src/snake/useCanvasViewport.ts",
          "operation": "modify",
          "description": "Adjust viewport measurement to be robust after the container resize changes: round container rect dimensions consistently, and throttle/merge ResizeObserver + window resize/orientation updates (e.g., via requestAnimationFrame scheduling) to avoid excessive re-renders while still updating promptly on real size changes."
        },
        {
          "path": "frontend/src/snake/SnakeCanvas.tsx",
          "operation": "modify",
          "description": "Ensure the canvas element visually fills its parent container without gaps by aligning CSS sizing with the container (e.g., prefer `width: 100%` / `height: 100%` via class styling and avoid mismatches from inline pixel styles), while keeping the backing store sized from `canvasWidth/canvasHeight` for DPR-crisp rendering."
        }
      ]
    }
  ]
}