{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hill Climb Offline: Photo Gallery with unlocks + responsive drive controls fix",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an in-game Photo Gallery screen with thumbnails showing locked/unlocked state, free first photo, tap-to-view or tap-to-unlock prompt.",
      "acceptanceCriteria": [
        "A new Photo Gallery entry point exists in the Hill Climb UI (e.g., accessible from Main Menu and/or Garage) and is visible without logging in.",
        "Gallery shows a grid/list of photo thumbnails with a clear locked/unlocked state.",
        "Photo #1 is unlocked on first launch (fresh localStorage) without requiring coins or any action.",
        "Tapping an unlocked photo opens a full-screen (or modal) viewer with a close/back control.",
        "Tapping a locked photo opens an unlock confirmation UI that explains the unlock action and its cost/requirements.",
        "After unlocking a photo, it immediately becomes viewable and remains unlocked after page refresh (local persistence)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hillclimb/screens/PhotoGalleryScreen.tsx",
          "operation": "create",
          "description": "Create a Photo Gallery screen that renders a thumbnail grid with locked overlays, opens an in-screen modal/overlay viewer for unlocked photos, and shows an unlock confirmation overlay for locked photos. Use shadcn-ui components (e.g., Button, Card) to match existing Hill Climb UI; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hillclimb/HillClimbApp.tsx",
          "operation": "modify",
          "description": "Add a new screen state for the Photo Gallery and wire navigation handlers to open/close it, passing the current progression state (coins + unlocked photos) and unlock action callbacks."
        },
        {
          "path": "frontend/src/hillclimb/screens/MainMenuScreen.tsx",
          "operation": "modify",
          "description": "Add a visible Photo Gallery entry button in the main menu that navigates to the new gallery screen (no login required). Use shadcn-ui Button for consistent styling; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust Hill Climb gallery layout styles (thumbnail grid, locked badge/overlay, viewer overlay sizing) using existing global styling entry point."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist photo unlock state offline via localStorage by extending the existing Hill Climb progression storage model.",
      "acceptanceCriteria": [
        "Unlock state is persisted using the same localStorage strategy used by Hill Climb progression (see frontend/src/hillclimb/progression/storage.ts).",
        "On a fresh install, only the first photo is marked unlocked by default; others are locked.",
        "Unlocking a photo updates the stored state and is reflected correctly after reload.",
        "No network connection is required to use the Photo Gallery or unlock/view photos."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hillclimb/progression/storage.ts",
          "operation": "modify",
          "description": "Extend the GameState model to include photo unlock state (e.g., an array/map of unlocked gallery photo IDs), ensure load-time migration for older stored states, and default-initialize Photo #1 as unlocked on fresh localStorage."
        },
        {
          "path": "frontend/src/hillclimb/HillClimbApp.tsx",
          "operation": "modify",
          "description": "Initialize and manage the photo unlock state as part of the in-memory gameState and ensure it is saved via the existing saveGameState effect when updated."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Integrate photo unlocking with the coin balance: show costs, block unlock on insufficient coins, deduct coins on confirm, and persist changes.",
      "acceptanceCriteria": [
        "Unlock UI shows the coin cost for locked photos.",
        "If coin balance is insufficient, the unlock action is disabled and cannot complete.",
        "If coin balance is sufficient and the user confirms, coin balance is reduced by the unlock cost and the photo becomes unlocked.",
        "Coin deduction and photo unlock persist after refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hillclimb/screens/PhotoGalleryScreen.tsx",
          "operation": "modify",
          "description": "Implement coin-cost display for each locked photo, disable/guard unlock confirmation when coins are insufficient, and trigger the provided unlock callback to atomically update coins + unlocked state. Use shadcn-ui Button/Card to present unlock confirmation UI; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hillclimb/HillClimbApp.tsx",
          "operation": "modify",
          "description": "Add an onPhotoUnlocked handler that checks affordability (defensive), deducts coins, updates unlocked photos in gameState, and relies on existing persistence to store the result."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix drive controls so throttle/brake reliably register at run start on touch and desktop, with no stuck-pressed states.",
      "acceptanceCriteria": [
        "On mobile/touch devices, pressing and holding the on-screen throttle button reliably increases vehicle movement (distance starts increasing) during a run.",
        "Releasing throttle reliably stops acceleration (vehicle eventually slows due to physics).",
        "Brake button reliably applies braking effect while held.",
        "Controls remain responsive even if the pointer is canceled or moves off the button (no “stuck pressed” state).",
        "Desktop keyboard controls (ArrowRight/D for throttle, ArrowLeft/A for brake) continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hillclimb/ui/DriveControls.tsx",
          "operation": "modify",
          "description": "Harden pointer handling by using pointer capture on press and handling pointercancel/lostpointercapture to always release throttle/brake; keep existing desktop behavior unchanged. Use existing shadcn-ui Button wrapper without modifying any files under frontend/src/components/ui; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hillclimb/screens/GameplayScreen.tsx",
          "operation": "modify",
          "description": "Add a safety reset for input state on window blur/visibility change and when gameplay unmounts/ends to prevent stuck throttle/brake across lifecycle transitions."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure control buttons remain touch-friendly and do not lose press state due to browser gestures (confirm/adjust touch-action and related styles on the control buttons if needed using existing CSS entry point)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add curated static gallery photos as frontend assets and reference them from the Photo Gallery UI with offline caching.",
      "acceptanceCriteria": [
        "Gallery photos are stored as static files under frontend/public/assets/generated and are referenced by URL from the frontend.",
        "Thumbnails and full-size viewing use these static assets and load offline (service worker caching continues to work)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/gallery-photo-01-free.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated static gallery image asset for Photo #1 (free)."
        },
        {
          "path": "frontend/public/assets/generated/gallery-photo-02-locked.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated static gallery image asset for Photo #2 (locked)."
        },
        {
          "path": "frontend/public/assets/generated/gallery-photo-03-locked.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated static gallery image asset for Photo #3 (locked)."
        },
        {
          "path": "frontend/public/assets/generated/gallery-photo-04-locked.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated static gallery image asset for Photo #4 (locked)."
        },
        {
          "path": "frontend/src/hillclimb/assets.ts",
          "operation": "modify",
          "description": "Add exported paths for the new gallery images so the gallery UI can reference them consistently (no backend routing)."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Add the four gallery image URLs to the pre-cache list so they are available offline under the existing service worker caching approach."
        },
        {
          "path": "frontend/src/hillclimb/screens/PhotoGalleryScreen.tsx",
          "operation": "modify",
          "description": "Wire the gallery UI to use the static asset paths for thumbnails and full-size viewing (using the same files, no backend)."
        }
      ]
    }
  ]
}